var dataItems = [
    ["两数相加", "多数连加", "两数相减", "两数相乘", "多数连乘", "平方数", "开平方", "两数相除", "根的判别式"],
    ["一位数加一位数", "两位数加两位数", "三位数加三位数", "四位数加四位数", "六位数加六位数", "八位数加八位数", "10位数加10位数", "20位数加20位数", "30位数加30位数", "60位数加60位数"],
    ["--无对应难度--", "--无对应难度--", "--无对应难度--", "--无对应难度--", "六位数加六位数", "3个六位数连加", "5个六位数连加", "7个六位数连加", "10个六位数相加", "20个六位数相加"],
    ["一位数减一位数", "两位数减两位数", "三位数减三位数", "四位数减四位数", "六位数减六位数", "八位数减八位数", "10位数减10位数", "20位数减20位数", "30位数减30位数", "60位数减60位数"],
    ["--无对应难度--", "一位数乘一位数", "--无对应难度--", "两位数乘一位数", "两位数乘两位数", "三位数乘两位数", "三位数乘三位数", "五位数乘五位数", "九位数乘九位数", "15位数乘15位数"],
    ["--无对应难度--", "--无对应难度--", "--无对应难度--", "--无对应难度--", "两位数乘两位数", "3个两位数连乘", "4个两位数连乘", "5个两位数连乘", "7个两位数连乘", "10个两位数连乘"],
    ["--无对应难度--", "1-9的平方", "--无对应难度--", "11-39的平方", "11-99的平方", "41-199的平方", "101-999的平方", "201-9999的平方", "1001-999999的平方", "10001-99999999的平方"],
    ["--无对应难度--", "1-2位数开平方", "--无对应难度--", "3位数开平方", "3-4位数开平方", "4-5位数开平方", "5-6位数开平方", "7-8位数开平方", "9-12位数开平方", "11-16位数开平方"],
    ["--无对应难度--", "--无对应难度--", "除以一位数得一位数", "除以一位数得两位数", "除以两位数得两位数", "除以两位数得三位数", "除以三位数得三位数", "除以四位数得五位数", "除以七位数得七位数", "除以10位数得10位数"],
    ["--无对应难度--", "--无对应难度--", "一位数", "--无对应难度--", "两位数", "三位数", "四位数", "五位数", "七位数", "十位数"]
], dataDiffs = ["入门-", "入门", "初级-", "初级", "中级-", "中级", "高级-", "高级", "专家-", "专家"], dataNumbers = [
    [1, 2, 3, 4, 6, 8, 10, 20, 30, 60],
    [0, 0, 0, 0, 2, 3, 5, 7, 10, 20],
    [1, 2, 3, 4, 6, 8, 10, 20, 30, 60],
    [0, 101, 0, 102, 202, 203, 303, 505, 909, 1515],
    [0, 0, 0, 0, 2, 3, 4, 5, 7, 10],
    [0, 1191, 0, 1232, 1292, 4213, 1393, 2394, 1496, 1598],
    [0, 1191, 0, 1232, 1292, 4233, 1393, 1494, 1596, 1698],
    [0, 0, 101, 102, 202, 203, 303, 405, 707, 1010],
    [0, 0, 1, 0, 2, 3, 4, 5, 7, 10],
];
